import '../../style/main/Motivation.css';
import React, { useState } from 'react'

const Motivation = () => {
    
     const [data, setData] = useState(["Сложнее всего начать действовать, все остальное зависит только от упорства. — Амелия Эрхарт.", "Начинать всегда стоит с того, что сеет сомнения. — Борис Стругацкий.", "Если я полон решимости, я преодолею любое препятствие. — Абай Кунанбаев.", "Обстоятельства часто можно изменить, изменив свое отношение к ним. — Элеонора Рузвельт.", "Вдохновение приходит только во время работы. — Габриэль Гарсиа Маркес.", "Если проблему можно решить, не стоит о ней беспокоиться. — Далай-лама XIV.", "Постановка целей — это первый шаг к превращению невидимого в видимое. — Тони Роббинс.", "Если вам не нравится дорога, по которой вы идете, начните прокладывать другую. — Долли Партон.", "Я твердо верю в удачу. И я заметил: чем больше я работаю, тем больше она мне улыбается. — Томас Джефферсон.", "Постарайтесь получить то, что любите, иначе придется полюбить то, что получили. — Джордж Бернард Шоу.", "Живите в соответствии со своим воображением, а не своим прошлым. — Стивен Кови.", "Дайте человеку цель, ради которой стоит жить, и он сможет выжить в любой ситуации. — Иоганн Вольфганг Гёте.", "Лидеры не рождаются и не делаются кем-либо — они делают себя сами. — Стивен Кови.", "Не позволяйте вчерашнему дню занимать слишком много места в сегодняшнем. — Уилл Роджерс.", "Измените свою жизнь сегодня. Не рассчитывайте на будущее, действуйте сейчас, не откладывая. — Симона де Бовуар.", "Делай сегодня то, что другие не хотят — завтра будешь жить так, как другие не могут. — Джаред Лето.", "Храбрость не всегда кричит. Иногда храбрость говорит тихим голосом в конце дня: Завтра я попытаюсь еще раз. — Мэри Энн Редмачер."]);
  const [randomValue, setRandomValue] = useState();

  function handleClick(event) {
     event.currentTarget.disabled = true;
    const randomIndex = Math.floor(Math.random() * data.length);
    setRandomValue(data[randomIndex]);
  }

    return (
        <div className='motivation'>
            <div className='motivation-block'>
               <button className="motivation-btn" onClick={handleClick}>Узнай свою мотивационную фразу на сегодня</button>
            <p className="motivation-text">При обновление страницы мотивационная фраза будет новой. <br /><br />Данные появляются в рандомном порядке.</p>  
            </div>
           
<div className="modalRandom">
     <p>{randomValue}</p>
</div>

           
        </div> 
       
    )
   
 
}
export default Motivation;